export const SORT_FILTER_TYPE = {
  createdAt: "최신순",
  likes: "좋아요순",
  views: "조회순",
};

export const SUBWAY_LINE_FILTER_TYPE = {
  "1": "1호선",
  "2": "2호선",
  "3": "3호선",
  "4": "4호선",
  "5": "5호선",
  "6": "6호선",
  "7": "7호선",
  "8": "8호선",
  "9": "9호선",
  수인분당: "수인분당",
  신분당: "신분당",
  "인천 1호선": "인천 1호선",
  "인천 2호선": "인천 2호선",
  에버라인: "에버라인",
  의정부: "의정부",
  우이신설: "우이신설",
  김포골드: "김포골드",
  신림: "신림",
};

export const SUBWAY_LINE_GRID_SECTION = [
  {
    "1": "1호선",
    "2": "2호선",
    "3": "3호선",
    "4": "4호선",
    "5": "5호선",
    "6": "6호선",
    "7": "7호선",
    "8": "8호선",
    "9": "9호선",
  },
  {
    수인분당: "수인분당",
    신분당: "신분당",
    "인천 1호선": "인천 1호선",
    "인천 2호선": "인천 2호선",
    에버라인: "에버라인",
    의정부: "의정부",
    우이신설: "우이신설",
    김포골드: "김포골드",
    신림: "신림",
  },
];
